package ru.ramprox.algorithms;

public class Theory {

    // ------------------------------------  Общие сведения  ------------------------------------

    // Многие структуры данных поддерживают операции вставки отдельных записей, поиска и удаления.
    // Перестановка содержимого структуры данных в определенном порядке называется сортировкой.
    // В БД поле представляет собой часть записи.
    // Поле, используемое для поиска конкретной записи, называется ключом.
    // В ООП объект может содержать данные и методы.
    // Класс представляет собой "шаблон" для создания объектов.
    // Когда объекту требуется выполнить операцию, он использует метод.
    // В Java для обращения к методам объекта необходимо использовать оператор точку.
    // В Java boolean и byte являются примитивными типами данных.

}
